

<?php
//فراخوانی کلاس برای خواندن فایل اکسل
include 'exel.php';



$a=0;
$arr=array();
if ( $xlsx = SimpleXLSX::parse( 'book1.xlsx' ) ) {
    foreach ( $xlsx->rows() as $r => $row ) {
        //راهی برای اندازه گیری تعداد ردیف ها
        $a++;
        //ریختن سلول با اندیس 1 از هر ردیف داخل ارایه


            array_push($arr,$row[1]);



        //برای مشخص کردن تعداد سلول ها هم میتونی از ی حلقه دیگه روی مقدار row استفاده کنی خوشگله پسر
    }

}
else {
    //چاپ هر گونه خطا در هنگام خواندن فایل اکسل
    echo SimpleXLSX::parseError();
}
$i=0;

echo "تعداد ردیف ها".$a;
echo "</br>";
echo $arr[0];
echo "</br>";
//حلقه برای انتخاب تصادفی 25 مقدار
while($i<=25)
{
    //جابجایی مقادیر ارایه که عملکردی همانند رندم دارد
   shuffle($arr);
   //برگرداندن مقدار 0 ارایه که بعد از تابع بالا در هر مرحله متفاوت است
    echo $arr[0];
    echo "</br>";
    $i++;
}

